app/views/tasks/_form.html.erb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]
---
        <%= f.label :category_id %>
        <%= f.select :category_id, options_from_collection_for_select(current_user.categories, :id, :name, f.object.category_id) %>