app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @category = current_user.categories.find(params[:id])

INSERT INTO "categories" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Charles Only"], ["description", "CHARLESSS"], ["created_at", "2021-01-17 13:20:38.260532"], ["updated_at", "2021-01-17 13:20:38.260532"], ["user_id", 1]]
---
    def create
        @category = current_user.categories.build(category_params)

        if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def edit
        @category = current_user.categories.find(params[:id])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "categories" SET "description" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["description", "4234234asdfasf"], ["updated_at", "2020-11-23 12:48:03.861080"], ["id", 6]]
---
    def update
        @category = current_user.categories.find(params[:id])

        if @category.update(category_params)

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ? AND "categories"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]
---
    def destroy
        @category = current_user.categories.find(params[:id])

        if @category.destroy