app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 3]]
---
    def delete
        @category = Category.find(params[:id])

        if @category.destroy