app/controllers/tasks_controller.rb

    def edit
        @task = current_user.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def show
        @task = current_user.tasks.find(params[:id])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def create
        @task = current_user.tasks.build(task_params)

        if @task.save
---
INSERT INTO "tasks" ("name", "details", "category_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "charles@akadsph.com"], ["details", "askldjfklasjf"], ["category_id", 1], ["created_at", "2021-01-17 13:21:20.464511"], ["updated_at", "2021-01-17 13:21:20.464511"], ["user_id", 2]]

    def update
        @task = current_user.tasks.find(params[:id])

        if @task.update(task_params)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "deadline" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["deadline", "2021-01-04 00:00:00"], ["updated_at", "2021-01-03 16:39:48.489078"], ["id", 4]]

    def destroy
        @task = current_user.tasks.find(params[:id])

        if @task.destroy
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ? AND "tasks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 5]]